Repository: pkp/crossref-ops
Catalog: locale/*/locale.po
Languages: fr_ca, id, uk

# plugins.importexport.crossref.displayName
source: CrossRef XML Export Plugin
fr_ca: Plugiciel d'exportation en format XML Crossref
id: Plugin Crossref XML Ekspor
uk: Плагін експорту XML у Crossref

# plugins.generic.crossref.displayName
source: Crossref Manager Plugin
fr_ca: Plugiciel de gestion Crossref
id: Plugin Crossref Manager
uk: Плагін менеджера Crossref

# plugins.generic.crossref.description
source: Handles depositing and exporting Crossref metadata
fr_ca: Gère le dépôt et l'exportation des métadonnées Crossref
id: Menangani deposit dan ekspor metadata Crossref
uk: Обробляє розміщення та експорт метаданих Crossref

# plugins.importexport.crossref.requirements
source: Requirements
fr_ca: Exigences
id: Persyaratan
uk: Вимоги

# plugins.importexport.crossref.requirements.satisfied
source: All plugin requirements are satisfied.
fr_ca: Toutes les exigences du plugiciels sont remplies.
id: Seluruh plugin memenuhi syarat.
uk: Усі вимоги плагіна виконано.

# plugins.importexport.crossref.settings.depositorIntro
source: The following items are required for a successful CrossRef deposit.
fr_ca: Les éléments suivants sont requis afin de réaliser le dépôt dans Crossref.
id: Hal-hal berikut diperlukan agar berhasil melakukan deposit Crossref.
uk: Для успішного подання в депозитарій Crossref потрібні такі елементи.

# plugins.importexport.crossref.settings.form.depositorName
source: Depositor name
fr_ca: Nom du déposant
id: Nama Depositor
uk: Ім'я депонента

# plugins.importexport.crossref.settings.form.depositorEmail
source: Depositor email
fr_ca: Courriel du déposant
id: Email depositor
uk: Електронна адреса депонента

# plugins.importexport.crossref.settings.form.depositorNameRequired
source: Please enter the depositor name.
fr_ca: S'il vous plaît, fournissez le nom du déposant.
id: Mohon masukkan nama depositor.
uk: Будь ласка, введіть ім'я депонента.

# plugins.importexport.crossref.settings.form.depositorEmailRequired
source: Please enter the depositor email.
fr_ca: S'il vous plaît, fournissez le courriel du déposant.
id: Mohon masukkan email depositor.
uk: Будь ласка, введіть адресу електронної пошти депонента.

# plugins.importexport.crossref.description
source: Export preprint metadata in CrossRef XML format.
fr_ca: Exporter les métadonnées de la prépublication en format XML Crossref.
id: Ekspor metadata preprint pada format Crossref XML.
uk: Експортувати метадані препринта у формат XML для Crossref.

# plugins.importexport.crossref.error.noDOIContentObjects
source: Preprints are not selected for DOI assignment in the DOI public identifier plugin, so there is no deposit or export possibility in this plugin.
id: Preprint tidak dipilih untuk penunjukkan DOI pada plugin DOI public identifier, sehingga tidak ada kemungkinan deposit atau ekspor pada plugin ini.
uk: Не вибрано препринти для призначення DOI в плагіні публічних ідентифікаторів DOI, тому немає можливості депонування або експортування в цьому плагіні.

# plugins.importexport.crossref.settings
source: Crossref Settings
fr_ca: Configurations Crossref
id: Pengaturan Crossref
uk: Налаштування Crossref

# plugins.importexport.crossref.settings.form.username
source: Username
fr_ca: Nom d'utilisateur
uk: Ім'я користувача

# plugins.importexport.crossref.settings.form.username.description
source: The Crossref username that will be used to authenticate your deposits. If you are using a personal account, see the advise above.
fr_ca: Le nom d'utilisateur Crossref qui sera utilisé pour l'authentification de vos dépôts. Si vous utilisez un compte personnel, consultez le conseil ci-dessus.
id: Username Crossref yang akan digunakan untuk mengautentifikasi deposit anda. Jika anda menggunakan akun pribadi, lihat saran di atas.
uk: Ім'я користувача Crossref, яке буде використовуватися для автентифікації ваших депонувань. Якщо ви використовуєте особистий обліковий запис, будь ласка, перегляньте поради вище.

# plugins.importexport.crossref.settings.form.usernameRequired
source: Please enter the username you got from Crossref.
fr_ca: S'il vous plait, inscrivez le nom d'utilisateur qui vous a été fourni par Crossref.
id: Mohon masukkan username yang anda terima dari Crossref.
uk: Будь ласка, введіть ім'я користувача, яке ви отримали від Crossref.

# plugins.importexport.crossref.settings.form.automaticRegistration.description
source: OPS will deposit assigned DOIs automatically to CrossRef. Please note that this may take a short amount of time after publication to process (e.g. depending on your cronjob configuration). You can check for all unregistered DOIs.
id: OPS akan mendeposit DOI secara otomatis ke Crossref. Mohon perhatikan bahwa ini akan memerlukan beberapa waktu setelah proses penerbitan (misalnya tergantung pada konfigurasi cronjob anda). Anda dapat memeriksa seluruh DOI yang belum teregistrasi.
uk: OPS буде автоматично депонувати призначені DOI на Crossref. Зверніть увагу, що після публікації обробка може зайняти деякий час (наприклад, залежно від налаштувань вашого кронджоб). Ви можете перевірити всі незареєстровані DOI.

source: plugins.importexport.crossref.settings.form.testMode.description
uk: Використовувати тестовий API Crossref (середовище тестування) для депонування DOI. Будь ласка, не забудьте прибрати цей параметр для подальшої роботи.

# plugins.importexport.crossref.settings.form.validation
source: Validate XML. Use this option for the XML download for the manual DOI registration.
fr_ca: Validation XML. Utiliser cette option pour le téléversement du XML pour l'enregistrement manuel du DOI.
id: Validasi XML. Gunakan opsi ini untuk mendownload XML untuk manual pendaftaran DOI.
uk: Перевірити XML. Використовуйте опцію для завантаження XML для ручної реєстрації DOI.

# plugins.importexport.crossref.status.failed
source: Failed
fr_ca: Échec
uk: Помилка

# plugins.importexport.crossref.status.registered
source: Active
fr_ca: Actif
uk: Активний

# plugins.importexport.crossref.status.markedRegistered
source: Marked active
uk: Позначено як активний

# plugins.importexport.crossref.action.register
source: Deposit
fr_ca: Déposer
uk: Депонувати

# plugins.importexport.crossref.action.export
source: Download XML
fr_ca: Télécharger le XML
uk: Завантажити XML

# plugins.importexport.crossref.action.markRegistered
source: Mark active
fr_ca: Marquer actif
uk: Позначити як активний

# plugins.importexport.crossref.senderTask.name
source: CrossRef automatic registration task
fr_ca: Tâche d'enregistrement automatique Crossref
uk: Завдання автоматичної реєстрації Crossref

# plugins.importexport.crossref.cliUsage
source: Usage: {$scriptName} {$pluginName} export [xmlFileName] [server_path] preprints objectId1 [objectId2] ... {$scriptName} {$pluginName} register [server_path] preprints objectId1 [objectId2] ...
fr_ca: Utilisation: {$scriptName} {$pluginName} export [xmlFileName] [server_path] preprints objectId1 [objectId2] ... {$scriptName} {$pluginName} register [server_path] preprints objectId1 [objectId2] ...
uk: Використання: {$scriptName} {$pluginName} export [xmlFileName] [server_path] preprints objectId1 [objectId2] ... {$scriptName} {$pluginName} register [server_path] preprints objectId1 [objectId2] ...

# plugins.importexport.crossref.register.error.mdsError
source: Registration was not fully successful! The DOI registration server returned an error.
fr_ca: L'enregistrement n'a pas été effectué. Le serveur d'enregistrement de DOI a renvoyé une erreur.
uk: Реєстрація не була повністю успішною! Сервер реєстрації DOI повернув помилку.

# plugins.importexport.crossref.register.success.warning
source: Registration was successful but the following warning occurred: '{$param}'.
fr_ca: L'enregistrement a bien été effectué, mais l'avertissement suivant s'est produit: '{$param}'.
uk: Реєстрація успішна, але отримано наступне попередження: "{$param}".

# plugins.importexport.crossref.export.error.issueNotFound
source: No issue matched the specified issue ID "{$issueId}".
fr_ca: Aucun numéro ne correspond à l'identifiant de numéro spécifié "{$issueId}".
uk: Немає випуску, який би відповідав указаному ID випуску "{$issueId}".

# plugins.generic.crossref.successMessage
source: The metadata for this item has been deposited with Crossref. To view further details, see the submission in the <a href="https://doi.crossref.org/servlet/submissionAdmin?sf=detail&submissionID={$submissionId}">Crossref admin panel</a>.
fr_ca: Les métadonnées de cet élément ont été déposées auprès de Crossref. Pour voir plus de détails, consulter la soumission dans le <a href="https://doi.crossref.org/servlet/submissionAdmin?sf=detail&submissionID={$submissionId}">panneau d'administration de Crossref</a>.
uk: Метадані цього елемента було збережено в Crossref. Щоб переглянути більш детальну інформацію, перегляньте подання в <a href="https://doi.crossref.org/servlet/submissionAdmin?sf=detail&submissionID={$submissionId}">адміністративній панелі Crossref</a>.

# plugins.importexport.crossref.settings.form.depositorName.description
source: Name of the organization registering the DOIs. It is included with deposited metadata and used to record who submitted the deposit.
fr_ca: Nom de l'organisation qui enregistre les DOI. Il est ajouté dans les dépôts de métadonnées et utilisé pour identifier qui a soumis le dépôt.
id: Nama organisasi yang mendaftarkan DOI. Ini termasuk metadata yang dideposit dan digunakan untuk merekam siapa yang mengirimkan deposit.
uk: Назва організації, що реєструє DOI. Воно включене до депонованих метаданих і використовується для запису того, хто подав на депонування.

# plugins.importexport.crossref.settings.form.depositorEmail.description
source: Email address of the individual responsible for registering content with Crossref. It is included with the deposited metadata and used when sending the deposit confirmation email.
fr_ca: Adresse courriel de la personne responsable de l'enregistrement du contenu avec Crossref. Elle est incluse dans les dépôts de métadonnées et utilisée lors de l'envoi des confirmations de dépôt.
id: Alamat email dari orang yang bertanggung jawab mendaftarkan konten dengan Crossref. Ini termasuk dengan metadata yang dideposit dan digunakan ketika mengirimkan email konfirmasi deposit.
uk: Адреса електронної пошти особи, відповідальної за реєстрацію контенту в Crossref. Вона включена до депонованих метаданих і використовується при відправці електронного листа на підтвердження депонування.

# plugins.importexport.crossref.registrationIntro
source: <p>If you would like to use this plugin to register Digital Object Identifiers (DOIs) directly with <a href="http://www.crossref.org/">Crossref</a>, you will need to add your <a href="https://www.crossref.org/documentation/member-setup/account-credentials/">Crossref account credentials</a> into the username and password fields below.</p><p>Depending on your Crossref membership, there are two ways to enter your username and password:</p><ul><li>If you are using an organizational account, add your <a href="https://www.crossref.org/documentation/member-setup/account-credentials/#00376">shared username and password</a></li><li>If you are using a <a href="https://www.crossref.org/documentation/member-setup/account-credentials/#00368">personal account</a>, enter your email address and the role in the username field. The username will look like: email@example.com/role</li><li>If you do not know or have access to your Crossref credentials, you can contact <a href="https://support.crossref.org/">Crossref support</a> for assistance. Without credentials, you may still export metadata into the Crossref XML format, but you cannot register your DOIs with Crossref from OPS.</li></ul>
fr_ca: <p>Si vous souhaitez utiliser ce plugiciel afin d'enregistrer des DOI directement avec <a href="http://www.crossref.org/">Crossref</a>, vous devez ajouter vos <a href="https://www.crossref.org/documentation/member-setup/account-credentials/">identifiants Crossref</a> dans les champs utilisateurs et mot de passe ci-dessous.</p><p>Selon votre type d'adhésion à Crossref, il y a 2 façons d'entrer votre nom d'utilisateur et votre mot de passe : </p><ul><li>Si vous utilisez un compte organisationnel, ajouter votre <a href="https://www.crossref.org/documentation/member-setup/account-credentials/#00376">nom d'utilisateur et mot de passe partagés</a></li><li>Si vous utilisez un <a href="https://www.crossref.org/documentation/member-setup/account-credentials/#00368">compte personnel</a>, inscrivez votre adresse courriel et le rôle dans le champ nom d'utilisateur. Le nom d'utilisateur doit ressembler à cela : email@example.com/role</li><li>Si vous ne connaissez pas ou n'avait pas accès à vos identifiants Crossref, contactez le <a href="https://support.crossref.org/">service de soutien Crossref</a>. Sans identifiants, vous pouvez tout de même exporter les métadonnées dans le format XML de Crossref, mais vous ne pourrez pas enregistrer vos DOI avec Crossref à partir d'OPS.</li></ul>
id: <p>Jika anda ingin menggunakan plugin ini untuk mendaftar Digital Object Identifiers (DOIs) secara langsung dengan <a href="http://www.crossref.org/">Crossref</a>, anda perlu untuk menambahkan <a href="https://www.crossref.org/documentation/member-setup/account-credentials/">Crossref account credentials</a> anda pada kolom username dan password di bawah ini.</p><p>Tergantung pada keanggotaan Crossref anda, terdapat dua cara untuk memasukkan username dan password anda:</p><ul><li>Jika anda menggunakan akun organisasi, tambahkan <a href="https://www.crossref.org/documentation/member-setup/account-credentials/#00376">username dan password bersama</a></li><li>Jika anda menggunakan <a href="https://www.crossref.org/documentation/member-setup/account-credentials/#00368">akun pribadi</a>, masukkan alamat email dan peranan pada kolom username. Username akan tampak seperti: email@example.com/role</li><li>Jika anda tidak mengetahui apakan anda memiliki akses ke kredensial Crossref, anda dapat menghubungi <a href="https://support.crossref.org/">Crossref support</a> untuk bantuan. Tanpa kredensial, anda tetap dapat mengekspor metadata ke dalam format Crossref XML, tetapi anda tidak dapat mendaftarkan DOI anda ke Crossref darI OPS.</li></ul>
uk: <p>Якщо ви хочете використовувати цей плагін для реєстрації цифрових ідентифікаторів об'єктів (DOI) безпосередньо за допомогою <a href="https://www.crossref.org/">Crossref</a>, вам потрібно буде додати ваші <a href="https://www.crossref.org/documentation/member-setup/account-credentials/">дані облікового запису Crossref</a> у поля імені користувача й пароля нижче.</p><p>Залежно від вашого членства в Crossref існують два способи введення імені користувача та пароля:</p><ul><li>якщо ви використовуєте обліковий запис, виданий організацією, додайте ваші <a href="https://www.crossref.org/documentation/member-setup/account-credentials/#00376">спільні ім'я користувача й пароль</a>;</li><li>якщо ви використовуєте <a href="https://www.crossref.org/documentation/member-setup/account-credentials/#00368">особистий обліковий запис</a>, введіть свою адресу електронної пошти та роль у полі імені користувача. Ім'я користувача матиме подібний вигляд: email@example.com/role.</li><li>Якщо ви не знаєте або не маєте доступу до своїх облікових даних Crossref, ви можете звернутися по допомогу до <a href="https://support.crossref.org/">служби підтримки Crossref</a>. Без облікових даних ви все ще можете експортувати метадані у формат XML для Crossref, але ви не можете зареєструвати свої DOI у Crossref з OJS.</li></ul>

# plugins.importexport.crossref.issues.description
source: Note: Only issues (and not their preprints) will be considered for export/registration here.
fr_ca: Note: seuls les numéros (et non leur prépublications) seront pris en considération lors de l'exportation / enregistrement.
id: Catatan: Hanya isu (dan bukan preprint) yang akan dipertimbangkan untuk ekspor/pendaftaran di sini.
uk: Примітка: для експорту / реєстрації тут розглядатимуться лише випуски (а не препринти з них).

# plugins.importexport.crossref.statusLegend
source: <p>Deposit status:</p> <p> - Not deposited: no deposit attempt has been made for this DOI.<br /> - Active: the DOI has been deposited, and is resolving correctly.<br /> - Failed: the DOI deposit has failed.<br /> - Marked active: the DOI was manually marked as active. </p> <p>Only the status of the last deposit attempt is displayed.</p> <p>If a deposit has failed, please solve the problem and try to register the DOI again.</p>
fr_ca: <p>Statuts de dépôt</p> <p> - Non déposé: aucune tentative de dépôt n'a été faite pour ce DOI.<br /> - Actif: le DOI a été déposé et est correctement résolu.<br /> - Échec: le dépôt du DOI a échoué.<br /> - Marqué actif: le DOI a été manuellement marqué comme actif. </p> <p>Seul le statut de la dernière tentative de dépôt est affiché.</p> <p>Si un dépôt a échoué, veuillez résoudre le problème et tenter d'enregistrer le DOI à nouveau.</p>
uk: <p>Статус депонування:</p> <p> - Не депонований: цей DOI не намагалися депонувати.<br /> - Активний: цей DOI був депонований і правильно інтерпретується.<br /> - Помилка: депонування DOI не відбулося.<br /> - Позначено як активний: DOI вручну позначено як активний. </p> <p>Відображається лише статус останньої спроби депонування.</p> <p>Якщо депонування не вдалося, усуньте проблему і спробуйте знову зареєструвати DOI.</p>

# plugins.importexport.crossref.export.error.preprintNotFound
source: No preprint matched the specified preprint ID "{$preprintId}".
fr_ca: Aucune prépublication avec l'identifiant "{$preprintId}".
uk: Немає препринта, який би відповідав указаному ID препринта "{$preprintId}".
